src/test/resources/mockdata/vouchers/a9b99f8a-7100-47f2-9903-6293d44a9905.json

{
  "systemCurrency": "USD",
  "invoiceCurrency": "EUR",
  "exchangeRate": 1.12,
  "exportToAccounting": false,
  "type": "Payment",
  "status": "Awaiting payment",
  "amount": 23.45,
  "voucherDate": "2019-05-06T00:00:00.000+0000",
  "voucherNumber": "1000",
  "invoiceId": "c0d08448-347b-418a-8c2f-5fb50248d67e",
  "accountingCode": "0206",
  "disbursementNumber": "EFT546789",
  "disbursementDate": "2019-05-05T00:00:00.000+0000",
  "disbursementAmount": 5,
  "batchGroupId": "e91d44e4-ae4f-401a-b355-3ea44f57a628"
}
